garyPenhook/PyAvrOCD/svd/atmega8515.svd
        <register>
          <name>LOW</name>
          <description>No Description.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SUT_CKSEL</name>
              <description>Select Clock Source</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXTCLK_6CK_0MS</name>
                  <description>Ext. Clock; Start-up time: 6 CK + 0 ms</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRCOSC_1MHZ_6CK_0MS</name>
                  <description>Int. RC Osc. 1 MHz; Start-up time: 6 CK + 0 ms</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRCOSC_2MHZ_6CK_0MS</name>
                  <description>Int. RC Osc. 2 MHz; Start-up time: 6 CK + 0 ms</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRCOSC_4MHZ_6CK_0MS</name>
                  <description>Int. RC Osc. 4 MHz; Start-up time: 6 CK + 0 ms</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRCOSC_8MHZ_6CK_0MS</name>
                  <description>Int. RC Osc. 8 MHz; Start-up time: 6 CK + 0 ms</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTRCOSC_XX_0MHZ9_18CK_0MS</name>
                  <description>Ext. RC Osc.         -  0.9 MHz; Start-up time: 18 CK + 0 ms</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTRCOSC_0MHZ9_3MHZ_18CK_0MS</name>
                  <description>Ext. RC Osc. 0.9 MHz -  3.0 MHz; Start-up time: 18 CK + 0 ms</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTRCOSC_3MHZ_8MHZ_18CK_0MS</name>
                  <description>Ext. RC Osc. 3.0 MHz -  8.0 MHz; Start-up time: 18 CK + 0 ms</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTRCOSC_8MHZ_12MHZ_18CK_0MS</name>
                  <description>Ext. RC Osc. 8.0 MHz - 12.0 MHz; Start-up time: 18 CK + 0 ms</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTLOFXTAL_1KCK_4MS</name>
                  <description>Ext. Low-Freq. Crystal; Start-up time: 1K CK + 4 ms</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTLOFXTALRES_258CK_4MS</name>
                  <description>Ext. Crystal/Resonator Low Freq.; Start-up time: 258 CK + 4 ms</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTLOFXTALRES_1KCK_64MS</name>
                  <description>Ext. Crystal/Resonator Low Freq.; Start-up time: 1K CK + 64 ms</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTMEDFXTALRES_258CK_4MS</name>
                  <description>Ext. Crystal/Resonator Medium Freq.; Start-up time: 258 CK + 4 ms</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTMEDFXTALRES_1KCK_64MS</name>
                  <description>Ext. Crystal/Resonator Medium Freq.; Start-up time: 1K CK + 64 ms</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTHIFXTALRES_258CK_4MS</name>
                  <description>Ext. Crystal/Resonator High Freq.; Start-up time: 258 CK + 4 ms</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTHIFXTALRES_1KCK_64MS</name>
                  <description>Ext. Crystal/Resonator High Freq.; Start-up time: 1K CK + 64 ms</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTCLK_6CK_4MS</name>
                  <description>Ext. Clock; Start-up time: 6 CK + 4 ms</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRCOSC_1MHZ_6CK_4MS</name>
                  <description>Int. RC Osc. 1 MHz; Start-up time: 6 CK + 4 ms</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRCOSC_2MHZ_6CK_4MS</name>
                  <description>Int. RC Osc. 2 MHz; Start-up time: 6 CK + 4 ms</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRCOSC_4MHZ_6CK_4MS</name>
                  <description>Int. RC Osc. 4 MHz; Start-up time: 6 CK + 4 ms</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRCOSC_8MHZ_6CK_4MS</name>
                  <description>Int. RC Osc. 8 MHz; Start-up time: 6 CK + 4 ms</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTRCOSC_XX_0MHZ9_18CK_4MS</name>
                  <description>Ext. RC Osc.         -  0.9 MHz; Start-up time: 18 CK + 4 ms</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTRCOSC_0MHZ9_3MHZ_18CK_4MS</name>
                  <description>Ext. RC Osc. 0.9 MHz -  3.0 MHz; Start-up time: 18 CK + 4 ms</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTRCOSC_3MHZ_8MHZ_18CK_4MS</name>
                  <description>Ext. RC Osc. 3.0 MHz -  8.0 MHz; Start-up time: 18 CK + 4 ms</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTRCOSC_8MHZ_12MHZ_18CK_4MS</name>
                  <description>Ext. RC Osc. 8.0 MHz - 12.0 MHz; Start-up time: 18 CK + 4 ms</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTLOFXTAL_1KCK_64MS</name>
                  <description>Ext. Low-Freq. Crystal; Start-up time: 1K CK + 64 ms</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTLOFXTALRES_258CK_64MS</name>
                  <description>Ext. Crystal/Resonator Low Freq.; Start-up time: 258 CK + 64 ms</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTLOFXTALRES_16KCK_0MS</name>
                  <description>Ext. Crystal/Resonator Low Freq.; Start-up time: 16K CK + 0 ms</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTMEDFXTALRES_258CK_64MS</name>
                  <description>Ext. Crystal/Resonator Medium Freq.; Start-up time: 258 CK + 64 ms</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTMEDFXTALRES_16KCK_0MS</name>
                  <description>Ext. Crystal/Resonator Medium Freq.; Start-up time: 16K CK + 0 ms</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTHIFXTALRES_258CK_64MS</name>
                  <description>Ext. Crystal/Resonator High Freq.; Start-up time: 258 CK + 64 ms</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTHIFXTALRES_16KCK_0MS</name>
                  <description>Ext. Crystal/Resonator High Freq.; Start-up time: 16K CK + 0 ms</description>
                  <value>31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTCLK_6CK_64MS</name>
                  <description>Ext. Clock; Start-up time: 6 CK + 64 ms</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRCOSC_1MHZ_6CK_64MS</name>
                  <description>Int. RC Osc. 1 MHz; Start-up time: 6 CK + 64 ms</description>
                  <value>33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRCOSC_2MHZ_6CK_64MS</name>
                  <description>Int. RC Osc. 2 MHz; Start-up time: 6 CK + 64 ms</description>
                  <value>34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRCOSC_4MHZ_6CK_64MS</name>
                  <description>Int. RC Osc. 4 MHz; Start-up time: 6 CK + 64 ms</description>
                  <value>35</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRCOSC_8MHZ_6CK_64MS</name>
                  <description>Int. RC Osc. 8 MHz; Start-up time: 6 CK + 64 ms</description>
                  <value>36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTRCOSC_XX_0MHZ9_18CK_64MS</name>
                  <description>Ext. RC Osc.         -  0.9 MHz; Start-up time: 18 CK + 64 ms</description>
                  <value>37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTRCOSC_0MHZ9_3MHZ_18CK_64MS</name>
                  <description>Ext. RC Osc. 0.9 MHz -  3.0 MHz; Start-up time: 18 CK + 64 ms</description>
                  <value>38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTRCOSC_3MHZ_8MHZ_18CK_64MS</name>
                  <description>Ext. RC Osc. 3.0 MHz -  8.0 MHz; Start-up time: 18 CK + 64 ms</description>
                  <value>39</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTRCOSC_8MHZ_12MHZ_18CK_64MS</name>
                  <description>Ext. RC Osc. 8.0 MHz - 12.0 MHz; Start-up time: 18 CK + 64 ms</description>
                  <value>40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTLOFXTAL_32KCK_64MS</name>
                  <description>Ext. Low-Freq. Crystal; Start-up time: 32K CK + 64 ms</description>
                  <value>41</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTLOFXTALRES_1KCK_0MS</name>
                  <description>Ext. Crystal/Resonator Low Freq.; Start-up time: 1K CK + 0 ms</description>
                  <value>42</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTLOFXTALRES_16KCK_4MS</name>
                  <description>Ext. Crystal/Resonator Low Freq.; Start-up time: 16K CK + 4 ms</description>
                  <value>43</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTMEDFXTALRES_1KCK_0MS</name>
                  <description>Ext. Crystal/Resonator Medium Freq.; Start-up time: 1K CK + 0 ms</description>
                  <value>44</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTMEDFXTALRES_16KCK_4MS</name>
                  <description>Ext. Crystal/Resonator Medium Freq.; Start-up time: 16K CK + 4 ms</description>
                  <value>45</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTHIFXTALRES_1KCK_0MS</name>
                  <description>Ext. Crystal/Resonator High Freq.; Start-up time: 1K CK + 0 ms</description>
                  <value>46</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTHIFXTALRES_16KCK_4MS</name>
                  <description>Ext. Crystal/Resonator High Freq.; Start-up time: 16K CK + 4 ms</description>
                  <value>47</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTRCOSC_XX_0MHZ9_6CK_4MS</name>
                  <description>Ext. RC Osc.         -  0.9 MHz; Start-up time: 6 CK + 4 ms</description>
                  <value>53</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTRCOSC_0MHZ9_3MHZ_6CK_4MS</name>
                  <description>Ext. RC Osc. 0.9 MHz -  3.0 MHz; Start-up time: 6 CK + 4 ms</description>
                  <value>54</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTRCOSC_3MHZ_8MHZ_6CK_4MS</name>
                  <description>Ext. RC Osc. 3.0 MHz -  8.0 MHz; Start-up time: 6 CK + 4 ms</description>
                  <value>55</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTRCOSC_8MHZ_12MHZ_6CK_4MS</name>
                  <description>Ext. RC Osc. 8.0 MHz - 12.0 MHz; Start-up time: 6 CK + 4 ms</description>
                  <value>56</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTLOFXTALRES_1KCK_4MS</name>
                  <description>Ext. Crystal/Resonator Low Freq.; Start-up time: 1K CK + 4 ms</description>
                  <value>58</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTLOFXTALRES_16KCK_64MS</name>
                  <description>Ext. Crystal/Resonator Low Freq.; Start-up time: 16K CK + 64 ms</description>
                  <value>59</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTMEDFXTALRES_1KCK_4MS</name>
                  <description>Ext. Crystal/Resonator Medium Freq.; Start-up time: 1K CK + 4 ms</description>
                  <value>60</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTMEDFXTALRES_16KCK_64MS</name>
                  <description>Ext. Crystal/Resonator Medium Freq.; Start-up time: 16K CK + 64 ms</description>
                  <value>61</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTHIFXTALRES_1KCK_4MS</name>
                  <description>Ext. Crystal/Resonator High Freq.; Start-up time: 1K CK + 4 ms</description>
                  <value>62</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTHIFXTALRES_16KCK_64MS</name>
                  <description>Ext. Crystal/Resonator High Freq.; Start-up time: 16K CK + 64 ms</description>
                  <value>63</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BODEN</name>
              <description>Brown-out detection enabled</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BODLEVEL</name>
              <description>Brownout detector trigger level</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>4V0</name>
                  <description>Brown-out detection at VCC=4.0 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2V7</name>
                  <description>Brown-out detection at VCC=2.7 V</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
